# TextLabelType Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
AnalysisDisplayDeformedShapeSettings..::..TextLabelType Property
AnalysisDisplayDeformedShapeSettings Class See Also
---
Type of deformed shape text visualization.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public AnalysisDisplayStyleDeformedShapeTextLabelType TextLabelType { get; set; }
```

Visual Basic
---
```text
Public Property TextLabelType As AnalysisDisplayStyleDeformedShapeTextLabelType
	Get
	Set
```

Visual C++
---
```text
public:
property AnalysisDisplayStyleDeformedShapeTextLabelType TextLabelType {
	AnalysisDisplayStyleDeformedShapeTextLabelType get ();
	void set (AnalysisDisplayStyleDeformedShapeTextLabelType value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

# See Also
AnalysisDisplayDeformedShapeSettings Class
Autodesk.Revit.DB.Analysis Namespace